; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	image0 - mode
	infrared5 - mode
	infrared3 - mode
	image6 - mode
	thermograph2 - mode
	infrared4 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	GroundStation11 - direction
	Star10 - direction
	GroundStation12 - direction
	Star5 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared4)
	(supports instrument0 image6)
	(supports instrument0 infrared3)
	(supports instrument0 infrared5)
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation11)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Phenomenon13 infrared3)
	(have_image Phenomenon14 infrared1)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 infrared1)
	(have_image Phenomenon15 infrared4)
	(have_image Star16 image0)
	(have_image Star16 infrared5)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (turn_to satellite0 phenomenon13 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 8
3. (turn_to satellite0 star5 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star5)
   goals met: 0 of 8
4. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 8
5. (turn_to satellite0 phenomenon13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 8
6. (take_image satellite0 phenomenon13 instrument0 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 1 of 8
7. (turn_to satellite0 phenomenon14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 8
8. (take_image satellite0 phenomenon14 instrument0 image0)
   added: (have_image phenomenon14 image0)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon14 instrument0 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon15 instrument0 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 4 of 8
12. (take_image satellite0 phenomenon15 instrument0 infrared4)
   added: (have_image phenomenon15 infrared4)
   goals met: 5 of 8
13. (turn_to satellite0 star16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star16)
   goals met: 5 of 8
14. (take_image satellite0 star16 instrument0 image0)
   added: (have_image star16 image0)
   goals met: 6 of 8
15. (take_image satellite0 star16 instrument0 infrared5)
   added: (have_image star16 infrared5)
   goals met: 7 of 8
16. (turn_to satellite0 star2 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star2)
   goals met: 8 of 8
